# **Cleaning data**

This notebook contains all the code from the first data cleaning performed to the raw datasets.

## **Setup**

In [23]:
!git clone https://github.com/yeray142/AIML_project

Cloning into 'AIML_project'...
remote: Enumerating objects: 44, done.
remote: Counting objects: 100% (44/44), done.
remote: Compressing objects: 100% (40/40), done.
remote: Total 44 (delta 14), reused 10 (delta 1), pack-reused 0
Unpacking objects: 100% (44/44), done.

In [24]:
cd AIML_project

/content/AIML_project/AIML_project

In [1]:
import pandas as pd
import numpy as np

train = pd.read_csv("../data/archive/train.csv", index_col=0)
test = pd.read_csv("../data/archive/test.csv", index_col=0)
train.head()

,gender,car,reality,child_num,income_total,income_type,edu_type,family_type,house_type,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,work_phone,phone,email,occyp_type,family_size,begin_month,credit
index,,,,,,,,,,,,,,,,,,,
0,F,N,N,0,202500.0,Commercial associate,Higher education,Married,Municipal apartment,-13899,-4709,1,0,0,0,NaN,2.0,-6.0,1.0
1,F,N,Y,1,247500.0,Commercial associate,Secondary / secondary special,Civil marriage,House / apartment,-11380,-1540,1,0,0,1,Laborers,3.0,-5.0,1.0
2,M,Y,Y,0,450000.0,Working,Higher education,Married,House / apartment,-19087,-4434,1,0,1,0,Managers,2.0,-22.0,2.0
3,F,N,Y,0,202500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,-15088,-2092,1,0,1,0,Sales staff,2.0,-37.0,0.0
4,F,Y,Y,0,157500.0,State servant,Higher education,Married,House / apartment,-15037,-2105,1,0,0,0,Managers,2.0,-26.0,2.0

## **Basic cleaning**

We will rename some columns just to standarize their names:

In [2]:
train.rename(columns={
    "DAYS_BIRTH": "days_birth", 
    "DAYS_EMPLOYED": "days_employed",
    "FLAG_MOBIL": "mobile_phone",
    "phone": "home_phone",
    "occyp_type": "occup_type"
    }, inplace=True)

train.columns

Index(['gender', 'car', 'reality', 'child_num', 'income_total', 'income_type',
       'edu_type', 'family_type', 'house_type', 'days_birth', 'days_employed',
       'mobile_phone', 'work_phone', 'home_phone', 'email', 'occup_type',
       'family_size', 'begin_month', 'credit'],
      dtype='object')

In [3]:
test.rename(columns={
    "DAYS_BIRTH": "days_birth", 
    "DAYS_EMPLOYED": "days_employed",
    "FLAG_MOBIL": "mobile_phone",
    "phone": "home_phone",
    "occyp_type": "occup_type"
    }, inplace=True)

test.columns

Index(['gender', 'car', 'reality', 'child_num', 'income_total', 'income_type',
       'edu_type', 'family_type', 'house_type', 'days_birth', 'days_employed',
       'mobile_phone', 'work_phone', 'home_phone', 'email', 'occup_type',
       'family_size', 'begin_month'],
      dtype='object')

As the only variable with null values is occup_type, let's fill these null values with "No job".

In [4]:
train.fillna("No job", inplace=True)
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26457 entries, 0 to 26456
Data columns (total 19 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         26457 non-null  object
 1   car            26457 non-null  object
 2   reality        26457 non-null  object
 3   child_num      26457 non-null  int64
 4   income_total   26457 non-null  float64
 5   income_type    26457 non-null  object
 6   edu_type       26457 non-null  object
 7   family_type    26457 non-null  object
 8   house_type     26457 non-null  object
 9   days_birth     26457 non-null  int64
 10  days_employed  26457 non-null  int64
 11  mobile_phone   26457 non-null  int64
 12  work_phone     26457 non-null  int64
 13  home_phone     26457 non-null  int64
 14  email          26457 non-null  int64
 15  occup_type     26457 non-null  object
 16  family_size    26457 non-null  float64
 17  begin_month    26457 non-null  float64
 18  credit         26457 non-null  float64
dtypes: float64(4), int64(7), object(8)
memory usage: 4.0+ MB

In [5]:
test.fillna("No job", inplace=True)
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 26457 to 36456
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         10000 non-null  object
 1   car            10000 non-null  object
 2   reality        10000 non-null  object
 3   child_num      10000 non-null  int64
 4   income_total   10000 non-null  float64
 5   income_type    10000 non-null  object
 6   edu_type       10000 non-null  object
 7   family_type    10000 non-null  object
 8   house_type     10000 non-null  object
 9   days_birth     10000 non-null  int64
 10  days_employed  10000 non-null  int64
 11  mobile_phone   10000 non-null  int64
 12  work_phone     10000 non-null  int64
 13  home_phone     10000 non-null  int64
 14  email          10000 non-null  int64
 15  occup_type     10000 non-null  object
 16  family_size    10000 non-null  float64
 17  begin_month    10000 non-null  float64
dtypes: float64(3), int64(7), object(8)
memory usage: 1.4+ MB

Removing mobile_phone, as everyone has a mobile phone, so this variable is redundant:

In [6]:
try:
  train.pop("mobile_phone")
  test.pop("mobile_phone")
except:
  print("mobile_phone is already removed.")

print(train.columns)
print(test.columns)

Index(['gender', 'car', 'reality', 'child_num', 'income_total', 'income_type',
       'edu_type', 'family_type', 'house_type', 'days_birth', 'days_employed',
       'work_phone', 'home_phone', 'email', 'occup_type', 'family_size',
       'begin_month', 'credit'],
      dtype='object')
Index(['gender', 'car', 'reality', 'child_num', 'income_total', 'income_type',
       'edu_type', 'family_type', 'house_type', 'days_birth', 'days_employed',
       'work_phone', 'home_phone', 'email', 'occup_type', 'family_size',
       'begin_month'],
      dtype='object')

Let's normalize the days_employed variable:

In [7]:
train.loc[(train.days_employed) >= 0,'days_employed'] = 0 # Some values are greater than 0, and this is impossible so we will change it into 0.
train[train['days_employed'] > 0].head()

Empty DataFrame
Columns: [gender, car, reality, child_num, income_total, income_type, edu_type, family_type, house_type, days_birth, days_employed, work_phone, home_phone, email, occup_type, family_size, begin_month, credit]
Index: []

In [8]:
test.loc[(test.days_employed) >= 0,'days_employed'] = 0
test[test['days_employed'] > 0].head()

Empty DataFrame
Columns: [gender, car, reality, child_num, income_total, income_type, edu_type, family_type, house_type, days_birth, days_employed, work_phone, home_phone, email, occup_type, family_size, begin_month]
Index: []

We will have to delete the following indices as the number of children in the family is equal or greater than the family size:

In [9]:
train[train['child_num'] >= train["family_size"]].head()

,gender,car,reality,child_num,income_total,income_type,edu_type,family_type,house_type,days_birth,days_employed,work_phone,home_phone,email,occup_type,family_size,begin_month,credit
index,,,,,,,,,,,,,,,,,,
5825,M,Y,Y,1,450000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-18173,-678,0,1,1,Core staff,1.0,-16.0,2.0
14900,M,Y,N,2,225000.0,Working,Secondary / secondary special,Married,House / apartment,-14776,-2212,0,0,0,Drivers,1.0,-30.0,2.0
16110,F,N,Y,1,108000.0,Working,Secondary / secondary special,Single / not married,House / apartment,-12723,-1132,1,1,0,Sales staff,1.0,-48.0,2.0
16791,F,N,Y,1,126000.0,Working,Secondary / secondary special,Married,House / apartment,-12140,-779,0,0,0,Core staff,1.0,-37.0,2.0
18879,M,N,Y,1,126000.0,Commercial associate,Secondary / secondary special,Civil marriage,House / apartment,-12755,-2105,0,0,0,No job,1.0,-39.0,2.0

In [10]:
train.drop(train.loc[(train.child_num) >= (train.family_size)].index, inplace=True)

In [11]:
train[train['child_num'] >= train["family_size"]].head()

Empty DataFrame
Columns: [gender, car, reality, child_num, income_total, income_type, edu_type, family_type, house_type, days_birth, days_employed, work_phone, home_phone, email, occup_type, family_size, begin_month, credit]
Index: []

## **Handling duplicated values**

We will create a CODE variable to handle with the data of the same person.

In [12]:
train['CODE'] = train['gender']+train['days_birth'].apply(str)+train['income_total'].apply(str)+train['income_type'].apply(str)
test['CODE'] = test['gender']+test['days_birth'].apply(str)+test['income_total'].apply(str)+test['income_type'].apply(str)

We have some duplicated values (including the credit variable), let's drop them:

In [14]:
train[train.duplicated()].shape

(1634, 19)

In [15]:
train.drop_duplicates(keep="first", inplace=True)
train[train.duplicated()].shape

(0, 19)

(DEPRECATED) Excluding the credit variable, we also have some duplicated values with different credit score. So, let's remove all of them: (DEPRECATED)

In [18]:
#train[train.duplicated(train.loc[:, train.columns != "credit"].columns, keep=False)].shape

(1425, 19)

In [115]:
#train.drop_duplicates(train.loc[:, train.columns != "credit"].columns, keep=False, inplace=True)

In [116]:
#train[train.duplicated(train.loc[:, train.columns != "credit"].columns, keep=False)].shape

(0, 18)

Just reseting index:

In [16]:
train.reset_index(drop=True, inplace=True)
train.index

RangeIndex(start=0, stop=24817, step=1)

In [17]:
train.head()

,gender,car,reality,child_num,income_total,income_type,edu_type,family_type,house_type,days_birth,days_employed,work_phone,home_phone,email,occup_type,family_size,begin_month,credit,CODE
0,F,N,N,0,202500.0,Commercial associate,Higher education,Married,Municipal apartment,-13899,-4709,0,0,0,No job,2.0,-6.0,1.0,F-13899202500.0Commercial associate
1,F,N,Y,1,247500.0,Commercial associate,Secondary / secondary special,Civil marriage,House / apartment,-11380,-1540,0,0,1,Laborers,3.0,-5.0,1.0,F-11380247500.0Commercial associate
2,M,Y,Y,0,450000.0,Working,Higher education,Married,House / apartment,-19087,-4434,0,1,0,Managers,2.0,-22.0,2.0,M-19087450000.0Working
3,F,N,Y,0,202500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,-15088,-2092,0,1,0,Sales staff,2.0,-37.0,0.0,F-15088202500.0Commercial associate
4,F,Y,Y,0,157500.0,State servant,Higher education,Married,House / apartment,-15037,-2105,0,0,0,Managers,2.0,-26.0,2.0,F-15037157500.0State servant

## **Absolute values for some of the columns**

In [19]:
train["days_employed"] = np.abs(train["days_employed"])
train["days_birth"] = np.abs(train["days_birth"])
train["begin_month"] = np.abs(train["begin_month"]).astype(int)
train.head()

,gender,car,reality,child_num,income_total,income_type,edu_type,family_type,house_type,days_birth,days_employed,work_phone,home_phone,email,occup_type,family_size,begin_month,credit,CODE
0,F,N,N,0,202500.0,Commercial associate,Higher education,Married,Municipal apartment,13899,4709,0,0,0,No job,2.0,6,1.0,F-13899202500.0Commercial associate
1,F,N,Y,1,247500.0,Commercial associate,Secondary / secondary special,Civil marriage,House / apartment,11380,1540,0,0,1,Laborers,3.0,5,1.0,F-11380247500.0Commercial associate
2,M,Y,Y,0,450000.0,Working,Higher education,Married,House / apartment,19087,4434,0,1,0,Managers,2.0,22,2.0,M-19087450000.0Working
3,F,N,Y,0,202500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,15088,2092,0,1,0,Sales staff,2.0,37,0.0,F-15088202500.0Commercial associate
4,F,Y,Y,0,157500.0,State servant,Higher education,Married,House / apartment,15037,2105,0,0,0,Managers,2.0,26,2.0,F-15037157500.0State servant

In [20]:
test["days_employed"] = np.abs(test["days_employed"])
test["days_birth"] = np.abs(test["days_birth"])
test["begin_month"] = np.abs(test["begin_month"]).astype(int)
test.head()

,gender,car,reality,child_num,income_total,income_type,edu_type,family_type,house_type,days_birth,days_employed,work_phone,home_phone,email,occup_type,family_size,begin_month,CODE
index,,,,,,,,,,,,,,,,,,
26457,M,Y,N,0,112500.0,Pensioner,Secondary / secondary special,Civil marriage,House / apartment,21990,0,0,1,0,No job,2.0,60,M-21990112500.0Pensioner
26458,F,N,Y,0,135000.0,State servant,Higher education,Married,House / apartment,18964,8671,0,1,0,Core staff,2.0,36,F-18964135000.0State servant
26459,F,N,Y,0,69372.0,Working,Secondary / secondary special,Married,House / apartment,15887,217,1,1,0,Laborers,2.0,40,F-1588769372.0Working
26460,M,Y,N,0,112500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,19270,2531,1,0,0,Drivers,2.0,41,M-19270112500.0Commercial associate
26461,F,Y,Y,0,225000.0,State servant,Higher education,Married,House / apartment,17822,9385,1,0,0,Managers,2.0,8,F-17822225000.0State servant

## **Save cleaned datasets**

In [21]:
train.to_csv("../data/cleaned_train.csv", index=True)
test.to_csv("../data/cleaned_test.csv", index=True)